{
  "backend/main.mo": "Main canister logic managing user profiles, daily orders, and karigar assignments with admin/user authorization checks.",
  "backend/migration.mo": "Migration module transforming old actor state to the new format by adding design fields and initializing design-to-karigar mapping.",
  "feature_evidence.json": "Feature evidence report listing features, related files, components, and test IDs for daily-orders functionality.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file involved in daily orders, parsing, UI, and export features.",
  "frontend/index.css": "Global Tailwind-based styling with OKLCH color tokens and light/dark theme variables.",
  "frontend/index.html": "HTML entry point loading the XLSX parser via CDN and bootstrapping the frontend application.",
  "frontend/src/App.tsx": "Main React app handling authentication, profile setup, and rendering the Daily Orders page layout.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button wired to Internet Identity with loading states and query cache clearing.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting authenticated users without a profile to enter and save their name.",
  "frontend/src/features/daily-orders/components/AssignmentPanel.tsx": "Dialog UI for assigning selected orders to a karigar and optional factory.",
  "frontend/src/features/daily-orders/components/ExportPanel.tsx": "Exports selected karigar’s orders to a PDF using exportKarigarPdf.",
  "frontend/src/features/daily-orders/components/GroupsSidebar.tsx": "Sidebar listing karigars and their order counts, enabling filtering by karigar.",
  "frontend/src/features/daily-orders/components/MappingApplyPanel.tsx": "Displays mapping summary stats and allows applying design-to-karigar mappings with overwrite option.",
  "frontend/src/features/daily-orders/components/OrdersTable.tsx": "Table showing orders with selection checkboxes and existing karigar assignments.",
  "frontend/src/features/daily-orders/components/OrdersToolbar.tsx": "Toolbar providing search and design-based sort controls for orders.",
  "frontend/src/features/daily-orders/DailyOrdersPage.tsx": "Main page managing daily orders, file uploads, filtering, karigar grouping, mapping, and assignment logic.",
  "frontend/src/features/daily-orders/excel/parseDailyOrders.ts": "Parses CSV or Excel daily orders files, validates required columns, and outputs structured ParsedOrder data.",
  "frontend/src/features/daily-orders/excel/parseKarigarMapping.ts": "Reads Excel sheets 1–3 and extracts design-to-karigar mappings using XLSX, returning a combined mapping object.",
  "frontend/src/features/daily-orders/hooks/useOrderFilters.ts": "Provides search and sort filtering for parsed orders based on text input and design sorting.",
  "frontend/src/features/daily-orders/pdf/exportKarigarPdf.ts": "Generates an HTML-based PDF-like report for a karigar’s daily orders and triggers a file download.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the authenticated identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login, logout, and identity persistence using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks to load and mutate user profiles, daily orders, and karigar assignments via the backend actor.",
  "frontend/src/index.css": "Configures Tailwind layers and CSS variables for light and dark themes and global styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/types/jspdf.d.ts": "Empty TypeScript declaration file for jspdf.",
  "frontend/src/types/xlsx.d.ts": "Defines global TypeScript types for the XLSX library attached to window.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, persisting, and clearing URL and session parameters for app state.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom colors, typography, animations, and container settings with several plugins.",
  "project_state.json": "Project metadata describing an order‑management app with Excel uploads, mapping workbook logic, feature list, and architectural notes."
}