{
  "backend/main.mo": "Motoko canister managing user profiles, daily orders, karigar mappings, and assignments with authorization checks and storage mixins.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Collection of short summaries describing the purpose of each frontend source file.",
  "frontend/ic-assets.json5": "Asset configuration controlling caching rules for index.html and other frontend files.",
  "frontend/index.css": "Tailwind base and theme definitions defining OKLCH color variables for light and dark modes.",
  "frontend/index.html": "Main HTML entry point loading SheetJS and the app’s root script.",
  "frontend/src/App.tsx": "Top-level React component with sidebar navigation and tabs for Order List, Daily Orders, and Karigar Mapping.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button using Internet Identity with loading states and error handling.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty placeholder file for a profile setup modal component.",
  "frontend/src/features/daily-orders/components/AssignmentPanel.tsx": "Dialog for assigning selected orders to a karigar and optional factory.",
  "frontend/src/features/daily-orders/components/ExportPanel.tsx": "Exports all orders for a selected factory as an HTML/PDF file.",
  "frontend/src/features/daily-orders/components/FactoryKarigarGroups.tsx": "Groups factory orders by karigar, supports filtering and per-karigar PDF export.",
  "frontend/src/features/daily-orders/components/GroupsSidebar.tsx": "Sidebar listing factories with counts and allowing factory selection.",
  "frontend/src/features/daily-orders/components/MappingApplyPanel.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/features/daily-orders/components/OrdersTable.tsx": "Table listing orders with selection, generic name lookup, and assignment display.",
  "frontend/src/features/daily-orders/components/OrdersToolbar.tsx": "Search and sort controls for filtering and ordering the orders list.",
  "frontend/src/features/daily-orders/DailyOrdersPage.tsx": "Main page for viewing, uploading, filtering, sorting, and saving daily orders with Excel parsing and diagnostics.",
  "frontend/src/features/daily-orders/excel/parseDailyOrders.ts": "Robust Excel/CSV parser that auto-detects headers, normalizes values, and outputs parsed orders with warnings.",
  "frontend/src/features/daily-orders/excel/parseKarigarMapping.ts": "Parses Excel or PDF karigar mapping files, detects column headers, and extracts design-to-karigar entries per sheet.",
  "frontend/src/features/daily-orders/export/exportDailyOrdersFile.ts": "Exports parsed daily orders to an Excel file, optionally including karigar and generic name columns.",
  "frontend/src/features/daily-orders/hooks/useOrderFilters.ts": "Provides search and sorting logic for filtering parsed orders by text and design.",
  "frontend/src/features/daily-orders/pdf/exportFactoryHtml.ts": "Generates an HTML file grouping orders by karigar with design and generic name lookup, then triggers download.",
  "frontend/src/features/daily-orders/pdf/exportKarigarPdf.ts": "Creates an HTML export of all orders for a single karigar, including generic names, sorted by design.",
  "frontend/src/features/karigar-mapping/getMappingSheetReadOrder.ts": "Computes deterministic sheet read order, prioritizing sheets 1, 3, and 2 before others alphabetically.",
  "frontend/src/features/karigar-mapping/karigarMappingBlobCodec.ts": "Encodes mapping data to a blob and decodes it back, recomputing normalized design keys for compatibility.",
  "frontend/src/features/karigar-mapping/KarigarMappingTab.tsx": "UI workflow for uploading, validating, parsing, summarizing, and saving karigar mapping workbooks.",
  "frontend/src/features/karigar-mapping/useKarigarMappingSummary.ts": "Decodes a mapping blob and returns a summary with ordered sheet names and total entry count.",
  "frontend/src/features/order-list/components/KarigarOrderGroups.tsx": "Renders grouped orders by karigar with selection checkboxes and supports exporting a karigar’s orders to Excel.",
  "frontend/src/features/order-list/components/KarigarOrdersTable.tsx": "Shows a table of enriched orders with selection controls for generic use within order views.",
  "frontend/src/features/order-list/OrderListTab.tsx": "Displays daily orders, enriches them with karigar mapping, groups by karigar, and shows diagnostics and selection state.",
  "frontend/src/features/order-list/useKarigarMappingLookup.ts": "Decodes the mapping blob into a normalized lookup map with priority sheet ordering and exposes mapping metadata.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useActorWithStatus.ts": "Wraps useActor to provide simplified readiness and loading status for components.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, exposing identity state, login, logout, and provider setup.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating daily orders and karigar assignments, including logic for syncing and reassigning orders.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light/dark themes and applies global background and text styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, configuring React Query and Internet Identity providers before rendering App.",
  "frontend/src/types/jspdf.d.ts": "Empty type declaration placeholder for jspdf.",
  "frontend/src/types/xlsx.d.ts": "Declares global TypeScript types for XLSX usage on the window object.",
  "frontend/src/utils/buildInfo.ts": "Provides helpers to read and format the build timestamp for display or programmatic use.",
  "frontend/src/utils/textNormalize.ts": "Implements text normalization utilities for cleaning Excel/CSV data, matching headers, and canonicalizing design codes.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and session-based parameters.",
  "frontend/src/utils/userFacingError.ts": "Maps internal errors to user-friendly messages with optional retry text.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, typography, animations, and additional plugins.",
  "project_state.json": "Defines project state for fixing karigar mapping by parsing mapping sheets from any sheet name and applying consistent design‑code normalization. Lists architectural notes, known issues, and existing/new feature requests related to Excel parsing and matching."
}