{
  "backend/main.mo": "Motoko canister managing daily orders, karigar assignments, and user profiles with mixed authorization rules and CRUD-style query/update methods.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend source file for reference.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color tokens and light/dark theme variables.",
  "frontend/index.html": "HTML entry point loading the app root and including the SheetJS XLSX library via CDN.",
  "frontend/src/App.tsx": "Top-level React component rendering the Daily Orders page with a header and footer, without authentication gating.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button using Internet Identity with loading states and query cache clearing on logout.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting unauthenticated users to submit their name and save a user profile.",
  "frontend/src/features/daily-orders/components/AssignmentPanel.tsx": "Dialog for assigning selected orders to a karigar and optional factory, using a mutation hook.",
  "frontend/src/features/daily-orders/components/ExportPanel.tsx": "Exports selected factory orders as HTML, showing a loading state during generation.",
  "frontend/src/features/daily-orders/components/FactoryKarigarGroups.tsx": "Groups orders by karigar within a factory and renders each group with an OrdersTable.",
  "frontend/src/features/daily-orders/components/GroupsSidebar.tsx": "Sidebar listing factories with order counts and allowing selection of a factory.",
  "frontend/src/features/daily-orders/components/MappingApplyPanel.tsx": "Displays mapping summary stats and unmatched designs, allowing applying mappings with an overwrite option.",
  "frontend/src/features/daily-orders/components/OrdersTable.tsx": "Table displaying order details with selection checkboxes and karigar assignment badges.",
  "frontend/src/features/daily-orders/components/OrdersToolbar.tsx": "Search and sort controls for filtering and ordering the orders list.",
  "frontend/src/features/daily-orders/DailyOrdersPage.tsx": "Main daily orders workflow handling uploads, filtering, factory grouping, assignments, mapping, and swipe navigation.",
  "frontend/src/features/daily-orders/excel/parseDailyOrders.ts": "Parses CSV or Excel files into ParsedOrder objects, detecting file type and validating required columns.",
  "frontend/src/features/daily-orders/excel/parseKarigarMapping.ts": "Parses design-to-karigar mappings from Excel sheets named 1, 2, and 3, aggregating them into a mapping object.",
  "frontend/src/features/daily-orders/hooks/useOrderFilters.ts": "Provides search and sort state for filtering orders by text and design using memoized results.",
  "frontend/src/features/daily-orders/pdf/exportFactoryHtml.ts": "Generates grouped factory order HTML by karigar and triggers download, formatting data and escaping HTML.",
  "frontend/src/features/daily-orders/pdf/exportKarigarPdf.ts": "Builds and downloads an HTML report for a single karigar’s orders with basic table styling and escaping.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and invalidates queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context with login, logout, identity loading, and state tracking.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend calls for profiles, orders, and assignments using React Query with automatic invalidation.",
  "frontend/src/index.css": "Defines Tailwind base layers and CSS variables for light and dark themes with shared styling tokens.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClient and InternetIdentityProvider and mounts it to the DOM.",
  "frontend/src/types/jspdf.d.ts": "Empty declaration file reserved for jsPDF typings.",
  "frontend/src/types/xlsx.d.ts": "Declares global XLSX types for reading spreadsheets and converting sheets to JSON.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routes), persist them in sessionStorage, and clear them when needed.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, animations, and plugins including typography, container queries, and animations.",
  "project_state.json": "Stores the project’s current state, requirements, issues, and feature definitions for an order‑management Excel‑upload app."
}