{
  "backend/main.mo": "Motoko canister implementing access-controlled storage for user profiles, daily orders, and karigar assignments with CRUD-style query and update methods.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, affected files, components, and test IDs for recent Daily Order Upload improvements.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of various frontend source files for documentation or build planning.",
  "frontend/ic-assets.json5": "IC asset configuration defining cache rules for index.html and other static assets.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color tokens and theme variables for light and dark modes.",
  "frontend/index.html": "Root HTML file loading the React app entry point and the SheetJS XLSX library with strict no-cache headers.",
  "frontend/src/App.tsx": "Main React app component providing navigation between Order List, Daily Order Upload, and Karigar Mapping tabs with mobile and desktop layouts.",
  "frontend/src/components/LoginButton.tsx": "Internet Identity login/logout button with loading states and automatic query cache clearing on logout.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty placeholder module for a profile setup modal component.",
  "frontend/src/features/daily-orders/components/AssignmentPanel.tsx": "Modal UI for assigning selected orders to a karigar and optional factory via a mutation.",
  "frontend/src/features/daily-orders/components/ExportPanel.tsx": "Button panel that exports all orders for a selected factory to HTML/PDF using provided mappings and assignments.",
  "frontend/src/features/daily-orders/components/FactoryKarigarGroups.tsx": "Groups orders by karigar within a factory, supports filtering and exporting per-karigar PDFs.",
  "frontend/src/features/daily-orders/components/GroupsSidebar.tsx": "Sidebar listing factories with order counts and allowing factory selection.",
  "frontend/src/features/daily-orders/components/MappingApplyPanel.tsx": "Empty file placeholder for mapping apply panel.",
  "frontend/src/features/daily-orders/components/OrdersTable.tsx": "Table showing orders with design, generic name, assignment info, and selectable rows.",
  "frontend/src/features/daily-orders/components/OrdersToolbar.tsx": "Toolbar providing order search and design-based sort controls.",
  "frontend/src/features/daily-orders/DailyOrdersPage.tsx": "Main page for uploading, parsing, viewing, filtering, sorting, and saving daily orders, with support for Excel import and backend sync.",
  "frontend/src/features/daily-orders/excel/parseDailyOrders.ts": "Parses Excel/CSV data into normalized order objects, detecting headers, extracting columns, and producing warnings.",
  "frontend/src/features/daily-orders/excel/parseKarigarMapping.ts": "Parses a karigar mapping file (Excel or PDF), detects relevant columns, and builds normalized mapping entries by sheet. Returns structured mapping prioritized by sheets 1, 3, then 2.",
  "frontend/src/features/daily-orders/export/exportDailyOrdersFile.ts": "Exports enriched daily orders to an Excel file using XLSX, adding optional generic name and karigar columns. Builds a worksheet from JSON and triggers a download.",
  "frontend/src/features/daily-orders/hooks/useOrderFilters.ts": "Provides search and sort filtering for orders based on text and design sorting. Returns filtered orders and controls for search and sort state.",
  "frontend/src/features/daily-orders/pdf/exportFactoryHtml.ts": "Generates an HTML file grouping orders by karigar with generic names and downloads it as a factory-level report. Sorts karigars and orders before building the HTML table layout.",
  "frontend/src/features/daily-orders/pdf/exportKarigarPdf.ts": "Builds an HTML file for a single karigar’s orders, sorted by design and enriched with generic names. Exports the content as a downloadable HTML file.",
  "frontend/src/features/karigar-mapping/karigarMappingBlobCodec.ts": "Encodes and decodes karigar mapping data to and from an ExternalBlob as JSON bytes. Provides simple utilities for serialization used during upload and retrieval.",
  "frontend/src/features/karigar-mapping/KarigarMappingTab.tsx": "UI tab for uploading, parsing, encoding, and saving karigar mapping files with progress tracking and error handling. Converts parsed mapping data into a backend‑savable blob format.",
  "frontend/src/features/order-list/components/KarigarOrderGroups.tsx": "Groups orders by karigar, displays them in tables, and supports selection and Excel export for each karigar.",
  "frontend/src/features/order-list/components/KarigarOrdersTable.tsx": "Renders a simple table of karigar orders with row selection via checkboxes.",
  "frontend/src/features/order-list/OrderListTab.tsx": "Displays and manages the daily order list, loading saved orders and mapping data, enriching orders via normalized design lookup, and supporting filtering and deletion. Builds mapping lookup with sheet priority for karigar and generic name assignment.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, reloading dependent queries when the identity changes.",
  "frontend/src/hooks/useActorWithStatus.ts": "Wraps useActor to expose readiness flags and a stub refetch function.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, stored identities, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching, storing, assigning, and removing daily orders and karigar assignments using the backend actor.",
  "frontend/src/index.css": "Tailwind CSS base styles and theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Initializes the app with React Query and Internet Identity providers and renders the root component.",
  "frontend/src/types/jspdf.d.ts": "Placeholder TypeScript declaration file for jsPDF.",
  "frontend/src/types/xlsx.d.ts": "Global TypeScript definitions for accessing XLSX APIs on the window object.",
  "frontend/src/utils/buildInfo.ts": "Provides helper functions to retrieve and format the build timestamp for UI display.",
  "frontend/src/utils/textNormalize.ts": "Provides functions to normalize text, headers, and design codes by removing hidden characters, standardizing punctuation, and simplifying whitespace for reliable matching.",
  "frontend/src/utils/urlParams.ts": "Implements helpers to read, persist, and clear URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/src/utils/userFacingError.ts": "Converts unknown or technical errors into user-friendly messages, with optional retry guidance.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS themes, colors, animations, and plugins including typography, container queries, and animations.",
  "project_state.json": "Describes the project’s current state, requirements, architectural notes, and known issues for the order management app."
}