{
  "backend/main.mo": "Motoko canister managing user profiles, daily orders, and karigar assignments with access control and query/update endpoints.",
  "feature_evidence.json": "Empty feature evidence report with no listed features.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files including components, hooks, pages, types, and utilities.",
  "frontend/index.css": "Tailwind base and theme variables defining OKLCH color tokens for light and dark modes.",
  "frontend/index.html": "HTML entry point loading the XLSX library via CDN and bootstrapping the frontend app.",
  "frontend/src/App.tsx": "Main app component with sidebar navigation switching between Order List, Daily Upload, and Karigar Mapping tabs.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button using Internet Identity with loading states and query cache clearing.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting first‑time users to save their name using the save profile mutation.",
  "frontend/src/features/daily-orders/components/AssignmentPanel.tsx": "Modal panel to assign a karigar and optional factory to selected orders via a mutation hook.",
  "frontend/src/features/daily-orders/components/ExportPanel.tsx": "Exports all orders for a selected factory as HTML using exportFactoryHtml, with loading state handling.",
  "frontend/src/features/daily-orders/components/FactoryKarigarGroups.tsx": "Groups factory orders by karigar, displays them with optional filtering, and supports per-karigar PDF export.",
  "frontend/src/features/daily-orders/components/GroupsSidebar.tsx": "Sidebar listing factories with order counts and allows selecting the active factory.",
  "frontend/src/features/daily-orders/components/MappingApplyPanel.tsx": "Empty file.",
  "frontend/src/features/daily-orders/components/OrdersTable.tsx": "Table showing orders with selection, mapping-based generic names, and karigar/factory assignment badges.",
  "frontend/src/features/daily-orders/components/OrdersToolbar.tsx": "Toolbar providing search input and design-based sort toggle for orders.",
  "frontend/src/features/daily-orders/DailyOrdersPage.tsx": "Daily orders workflow including file upload, parsing, filtering, assignments, mapping, and export logic.",
  "frontend/src/features/daily-orders/excel/parseDailyOrders.ts": "Parses CSV or Excel daily order files, validates headers, and outputs normalized ParsedOrder objects.",
  "frontend/src/features/daily-orders/excel/parseKarigarMapping.ts": "Parses karigar mapping from Excel or PDF, detecting relevant columns and producing sheet-based mapping data.",
  "frontend/src/features/daily-orders/hooks/useOrderFilters.ts": "Hook providing search and sort filtering for ParsedOrder lists.",
  "frontend/src/features/daily-orders/pdf/exportFactoryHtml.ts": "Generates an HTML file listing all factory orders grouped by karigar and triggers a download.",
  "frontend/src/features/daily-orders/pdf/exportKarigarPdf.ts": "Creates a sorted HTML report of a single karigar’s orders and downloads it as an HTML file.",
  "frontend/src/features/karigar-mapping/KarigarMappingTab.tsx": "UI for uploading, parsing, and saving the karigar mapping workbook with success and error handling.",
  "frontend/src/features/order-list/OrderListTab.tsx": "Displays daily orders grouped by factory, builds a mapping lookup, and manages date and factory selection.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling login, stored identities, and client initialization.",
  "frontend/src/hooks/useQueries.ts": "React‑query hooks for fetching and mutating orders, assignments, user profiles, and karigar mappings via the backend actor.",
  "frontend/src/index.css": "Sets Tailwind layers and defines light/dark theme CSS variables and base styles including background, text, and border defaults.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and InternetIdentityProvider and loads global styles.",
  "frontend/src/types/jspdf.d.ts": "Empty type declaration file for jspdf.",
  "frontend/src/types/xlsx.d.ts": "Adds global TypeScript types for XLSX usage on window, including read and sheet_to_json helpers.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters for navigation and state persistence.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom color variables, typography, animations, and plugins including container queries and animate.",
  "project_state.json": "Project metadata describing the order management app design, architecture notes, issues, and existing feature records."
}