{
  "backend/main.mo": "Motoko canister providing access-controlled user profiles, daily orders, karigar mappings, and karigar assignments with storage mixins.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, related frontend files, components, and test references for two major features.",
  "frontend-file-summaries.txt": "Text file containing prewritten short summaries of numerous frontend files for reference.",
  "frontend/ic-assets.json5": "Asset configuration defining cache rules for index.html and all other frontend assets.",
  "frontend/index.css": "Tailwind base and theme variables defining light and dark mode color tokens and global styling.",
  "frontend/index.html": "Main HTML entry point loading the React app and SheetJS script with aggressive no-cache headers.",
  "frontend/src/App.tsx": "Top-level React app with navigation tabs, responsive sidebar, build ID display, and tab routing.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button integrating Internet Identity with loading states and query cache clearing.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty placeholder file for a profile setup modal component.",
  "frontend/src/features/daily-orders/components/AssignmentPanel.tsx": "UI dialog for assigning selected orders to a karigar and optional factory, triggering a mutation and resetting state on success.",
  "frontend/src/features/daily-orders/components/ExportPanel.tsx": "Exports all orders for a selected factory to HTML, showing a loading state and disabling the button when unavailable.",
  "frontend/src/features/daily-orders/components/FactoryKarigarGroups.tsx": "Groups factory orders by karigar, supports filtering and PDF export per karigar, and displays their tables.",
  "frontend/src/features/daily-orders/components/GroupsSidebar.tsx": "Sidebar listing factories with order counts, allowing selection and sorting 'No Factory' last.",
  "frontend/src/features/daily-orders/components/MappingApplyPanel.tsx": "Empty file with no implementation.",
  "frontend/src/features/daily-orders/components/OrdersTable.tsx": "Displays orders in a table with selection, generic name lookup, and assignment badges for karigar and factory.",
  "frontend/src/features/daily-orders/components/OrdersToolbar.tsx": "Toolbar providing search input and design-code sorting toggle.",
  "frontend/src/features/daily-orders/DailyOrdersPage.tsx": "Daily Orders upload page handling Excel parsing, validation, filtering, sorting, diagnostics, and saving to backend.",
  "frontend/src/features/daily-orders/excel/parseDailyOrders.ts": "Parses daily-order spreadsheets or CSVs by detecting headers, extracting columns via aliases, and returning parsed orders with warnings.",
  "frontend/src/features/daily-orders/excel/parseKarigarMapping.ts": "Parses karigar mapping files (Excel or PDF), detecting required columns and producing normalized design-to-karigar and generic-name mappings.",
  "frontend/src/features/daily-orders/export/exportDailyOrdersFile.ts": "Exports enriched daily orders to an Excel file using XLSX, building rows with optional karigar and generic name.",
  "frontend/src/features/daily-orders/hooks/useOrderFilters.ts": "Provides search and sort filtering for orders, returning filtered results and filter state setters.",
  "frontend/src/features/daily-orders/pdf/exportFactoryHtml.ts": "Generates an HTML file grouping orders by karigar with generic names and triggers a download for factory-wide reports.",
  "frontend/src/features/daily-orders/pdf/exportKarigarPdf.ts": "Creates an HTML report for a single karigar’s orders, including generic names, and downloads it as an HTML file.",
  "frontend/src/features/karigar-mapping/getMappingSheetReadOrder.ts": "Determines deterministic sheet read order by prioritizing sheets 1, 3, 2, then sorting remaining names alphabetically.",
  "frontend/src/features/karigar-mapping/karigarMappingBlobCodec.ts": "Encodes and decodes mapping data to and from ExternalBlob, ensuring normalized design codes and required generic names.",
  "frontend/src/features/karigar-mapping/KarigarMappingTab.tsx": "UI for uploading, validating, parsing, and saving karigar mapping files with progress and error handling.",
  "frontend/src/features/karigar-mapping/useKarigarMappingSummary.ts": "React hook that decodes a mapping blob and returns total entry count and ordered sheet names with error handling.",
  "frontend/src/features/order-list/components/KarigarOrderGroups.tsx": "Component that groups orders by karigar, displays them in a table, and supports selection and Excel export per karigar.",
  "frontend/src/features/order-list/components/KarigarOrdersTable.tsx": "Simple table component that lists orders with checkbox selection for bulk actions.",
  "frontend/src/features/order-list/OrderListTab.tsx": "Displays daily orders enriched with mapping data, grouped by karigar, with date filters and diagnostic info.",
  "frontend/src/features/order-list/useKarigarMappingLookup.ts": "Hook that decodes a mapping blob into a lookup map of design codes to karigar info, respecting sheet priority and normalization.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useActorWithStatus.ts": "Wraps useActor to expose readiness flags and a simple refetch interface.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity restoration, and exposing login state.",
  "frontend/src/hooks/useQueries.ts": "React-query hooks for fetching and mutating daily orders and karigar assignments, tied to the backend actor.",
  "frontend/src/index.css": "Tailwind base styles and theme variables for light and dark modes.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity provider before rendering the app.",
  "frontend/src/types/jspdf.d.ts": "Empty type declaration placeholder for jspdf.",
  "frontend/src/types/xlsx.d.ts": "Type declarations for XLSX library exposed on the window object.",
  "frontend/src/utils/buildInfo.ts": "Provides build timestamp utilities, formatting a readable build ID and exposing the raw timestamp.",
  "frontend/src/utils/textNormalize.ts": "Offers text normalization helpers for cleaning Excel/CSV values, standardizing headers, canonicalizing design codes, and matching header aliases.",
  "frontend/src/utils/urlParams.ts": "Handles reading, persisting, and clearing URL parameters across routing modes and sessionStorage.",
  "frontend/src/utils/userFacingError.ts": "Converts unknown errors into user-friendly messages and appends retry guidance when needed.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, typography, animations, and container settings with plugins.",
  "project_state.json": "Stores project metadata, feature definitions, and requirements for the master design upload and karigar filtering functionality."
}