{
  "backend/main.mo": "Motoko canister managing daily orders, karigar mappings, assignments, user profiles, and blob storage with access‑controlled CRUD methods.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, related files, components, tests, and confidence for PDF.js loading and karigar mapping UX improvements.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend source files, describing key components, hooks, pages, parsers, and utilities.",
  "frontend/ic-assets.json5": "Asset rules configuring caching behavior, disabling cache for index.html and enabling long‑term caching for other assets.",
  "frontend/index.css": "Tailwind base styles defining extensive OKLCH color variables for light and dark themes with global background and border utilities.",
  "frontend/index.html": "HTML entry point loading SheetJS and PDF.js from CDNs and mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React app with header, sidebar navigation, tabs for orders and mapping, and build ID display.",
  "frontend/src/components/LoginButton.tsx": "Internet Identity login/logout button handling auth state, loading, and query cache clearing on logout.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file placeholder for a profile setup modal component.",
  "frontend/src/features/daily-orders/components/AssignmentPanel.tsx": "A dialog UI for assigning selected orders to a karigar and optional factory using a mutation hook.",
  "frontend/src/features/daily-orders/components/ExportPanel.tsx": "Provides an export button that generates factory-level HTML output for the selected factory’s orders.",
  "frontend/src/features/daily-orders/components/FactoryKarigarGroups.tsx": "Groups factory orders by assigned karigar, supports filtering, viewing, and exporting karigar-specific PDFs.",
  "frontend/src/features/daily-orders/components/GroupsSidebar.tsx": "Displays a sidebar list of factories with order counts and allows selecting a factory for viewing.",
  "frontend/src/features/daily-orders/components/MappingApplyPanel.tsx": "Empty or placeholder file with no implemented logic.",
  "frontend/src/features/daily-orders/components/OrdersTable.tsx": "Renders a selectable orders table showing design, generic name, and assignment details using mapping and assignment data.",
  "frontend/src/features/daily-orders/components/OrdersToolbar.tsx": "Provides search and design-based sorting controls for the orders list.",
  "frontend/src/features/daily-orders/DailyOrdersPage.tsx": "Daily orders upload page with parsing, diagnostics, filtering, sorting, saving, and error handling.",
  "frontend/src/features/daily-orders/excel/parseDailyOrders.ts": "Parses daily order spreadsheets or CSVs, detects header rows, extracts normalized order fields, and returns orders with warnings.",
  "frontend/src/features/daily-orders/excel/parseKarigarMapping.ts": "Parses karigar mapping files (Excel or PDF), detecting design, generic name, and karigar columns to build a normalized lookup map.",
  "frontend/src/features/daily-orders/export/exportDailyOrdersFile.ts": "Exports parsed daily orders to an Excel file using XLSX, adding optional karigar and generic name fields.",
  "frontend/src/features/daily-orders/hooks/useOrderFilters.ts": "Provides search and sort functionality for daily orders, filtering by text and sorting by design.",
  "frontend/src/features/daily-orders/pdf/exportFactoryHtml.ts": "Generates and downloads an HTML report grouping orders by karigar with generic names, sorted for factory-wide output.",
  "frontend/src/features/daily-orders/pdf/exportKarigarPdf.ts": "Generates an HTML file listing a single karigar's orders with normalized design lookups for generic names.",
  "frontend/src/features/karigar-mapping/getMappingSheetReadOrder.ts": "Determines deterministic sheet read order by prioritizing sheets 1, 3, and 2, then sorting remaining names.",
  "frontend/src/features/karigar-mapping/karigarMappingBlobCodec.ts": "Encodes and decodes karigar mapping data to and from backend blobs, recomputing normalized design codes.",
  "frontend/src/features/karigar-mapping/KarigarMappingTab.tsx": "UI for uploading, parsing, validating, and saving karigar mapping workbooks with progress, errors, and summaries.",
  "frontend/src/features/karigar-mapping/useKarigarMappingSummary.ts": "Loads and decodes mapping blobs, returning total entries and ordered sheet names with error handling.",
  "frontend/src/features/order-list/components/KarigarOrderGroups.tsx": "Displays orders grouped by karigar with selection checkboxes and Excel export per karigar.",
  "frontend/src/features/order-list/components/KarigarOrdersTable.tsx": "Renders a simple table of karigar orders with selection handling.",
  "frontend/src/features/order-list/OrderListTab.tsx": "Displays daily orders enriched with mapping data, allowing filtering by karigar and providing diagnostics.",
  "frontend/src/features/order-list/useKarigarMappingLookup.ts": "Decodes a mapping blob into a normalized lookup map using prioritized sheet order and react-query.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries on change.",
  "frontend/src/hooks/useActorWithStatus.ts": "Wraps useActor to provide simplified readiness and status flags.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login state management, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Defines react-query hooks for fetching and mutating daily orders and karigar assignments via the backend actor.",
  "frontend/src/index.css": "Sets up Tailwind and CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity provider.",
  "frontend/src/types/jspdf.d.ts": "Empty type declaration file placeholder for jspdf.",
  "frontend/src/types/xlsx.d.ts": "Type declarations for XLSX utilities on the Window object.",
  "frontend/src/utils/buildInfo.ts": "Formats and exposes the build timestamp, returning a human-readable build ID or raw timestamp.",
  "frontend/src/utils/pdfjs.ts": "Checks PDF.js availability and configures its worker source, providing initialization and readiness helpers.",
  "frontend/src/utils/textNormalize.ts": "Provides text normalization utilities for cleaning cell values, headers, and design codes for reliable matching.",
  "frontend/src/utils/urlParams.ts": "Gets, stores, and clears URL parameters with session persistence and hash-based routing support.",
  "frontend/src/utils/userFacingError.ts": "Converts unknown errors into user-friendly messages with special handling for PDF.js, network, and parsing errors.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, typography, animations, and plugins.",
  "project_state.json": "Project state metadata describing known issues, existing features, and context for fixing PDF.js loading errors."
}