{
  "backend/main.mo": "Motoko canister defining user profiles, daily orders, karigar mappings, and assignments with access‑controlled CRUD APIs and blob‑storage mixins.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files describing their roles in the application.",
  "frontend/ic-assets.json5": "Asset configuration controlling caching behavior, disabling cache for index.html and setting long cache for other assets.",
  "frontend/index.css": "Global Tailwind setup defining OKLCH-based design tokens for light and dark themes.",
  "frontend/index.html": "Base HTML entry point loading the React app and SheetJS library with no-cache headers.",
  "frontend/src/App.tsx": "Main React app component with navigation, sidebar, build ID display, and tab-based routing.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button using Internet Identity with loading states and query cache clearing.",
  "frontend/src/components/ProfileSetupModal.tsx": "Placeholder file for a profile setup modal component with no content provided.",
  "frontend/src/features/daily-orders/components/AssignmentPanel.tsx": "Dialog for assigning selected orders to a karigar and optional factory using a mutation hook.",
  "frontend/src/features/daily-orders/components/ExportPanel.tsx": "Exports all orders for the selected factory to HTML/PDF, handling loading state.",
  "frontend/src/features/daily-orders/components/FactoryKarigarGroups.tsx": "Groups factory orders by karigar, supports filtering, selection, and per‑karigar PDF export.",
  "frontend/src/features/daily-orders/components/GroupsSidebar.tsx": "Sidebar listing factories with order counts and selection controls.",
  "frontend/src/features/daily-orders/components/MappingApplyPanel.tsx": "Empty placeholder component file.",
  "frontend/src/features/daily-orders/components/OrdersTable.tsx": "Table displaying orders with assignment, generic name mapping, and row selection.",
  "frontend/src/features/daily-orders/components/OrdersToolbar.tsx": "Toolbar providing search and design‑code sorting controls for the orders table.",
  "frontend/src/features/daily-orders/DailyOrdersPage.tsx": "Main page for viewing, uploading, parsing, filtering, sorting, and saving daily orders with selection and diagnostics.",
  "frontend/src/features/daily-orders/excel/parseDailyOrders.ts": "Parses Excel/CSV rows into normalized orders, auto‑detects headers, and returns warnings.",
  "frontend/src/features/daily-orders/excel/parseKarigarMapping.ts": "Parses karigar mapping files from Excel or PDF, detects relevant columns, and builds normalized mapping entries per sheet. Prioritizes sheets 1 and 3 over 2 and normalizes design codes for lookup.",
  "frontend/src/features/daily-orders/export/exportDailyOrdersFile.ts": "Exports enriched daily orders to an Excel file, adding generic name and karigar columns when available. Builds a worksheet from orders and triggers a file download.",
  "frontend/src/features/daily-orders/hooks/useOrderFilters.ts": "Provides search and sorting logic for filtering orders by text and sorting by design. Returns filtered orders and state handlers.",
  "frontend/src/features/daily-orders/pdf/exportFactoryHtml.ts": "Generates an HTML file grouping orders by karigar for a factory-wide view, including generic names via normalized design lookup. Downloads the result as an HTML file.",
  "frontend/src/features/daily-orders/pdf/exportKarigarPdf.ts": "Generates an HTML export for a single karigar’s orders with generic names resolved via normalized design codes. Creates and downloads an HTML file.",
  "frontend/src/features/karigar-mapping/karigarMappingBlobCodec.ts": "Encodes and decodes karigar mapping data to and from a JSON-based ExternalBlob, recomputing normalized design keys for backward compatibility. Ensures stored data is canonical for lookup.",
  "frontend/src/features/karigar-mapping/KarigarMappingTab.tsx": "UI for uploading, parsing, and saving karigar mapping files with progress tracking and error handling. Converts parsed mappings to storable blob format and sends them to the backend.",
  "frontend/src/features/order-list/components/KarigarOrderGroups.tsx": "Renders grouped orders by karigar with selection checkboxes and an Excel export button, showing either all groups or a single selected karigar.",
  "frontend/src/features/order-list/components/KarigarOrdersTable.tsx": "Displays a simple table of karigar orders with selection checkboxes and basic order fields.",
  "frontend/src/features/order-list/OrderListTab.tsx": "Fetches daily orders and mapping data, enriches orders with karigar and generic names, and groups them for display. Includes diagnostics and UI state for filtering and selection.",
  "frontend/src/features/order-list/useKarigarMappingLookup.ts": "Decodes a mapping blob into a lookup map keyed by normalized design codes, handling priority sheets and exposing decode status.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, recreating it on identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useActorWithStatus.ts": "Wraps useActor to provide simple ready/loading status and a placeholder refetch handler.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, managing login, stored identity loading, and exposing identity state and status flags.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating daily orders and karigar assignments using the backend actor.",
  "frontend/src/index.css": "Sets up Tailwind base styles and custom CSS variables for light and dark mode themes.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/types/jspdf.d.ts": "Empty type declaration file placeholder for jspdf.",
  "frontend/src/types/xlsx.d.ts": "Declares TypeScript definitions for window.XLSX to support reading and writing Excel data.",
  "frontend/src/utils/buildInfo.ts": "Provides helpers to return a human-readable or raw build timestamp injected by Vite.",
  "frontend/src/utils/textNormalize.ts": "Offers text normalization functions for cleaning cell values, headers, and design codes, plus header-alias matching.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL params, persisting them in sessionStorage, and managing hash-based parameters.",
  "frontend/src/utils/userFacingError.ts": "Converts unknown errors into user-friendly messages and adds retry guidance when needed.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom colors, typography, container settings, and animations.",
  "project_state.json": "Describes the app’s state, requirements, known issues, and architecture for the order-management workflow."
}