{
  "backend/main.mo": "Motoko canister handling user profiles, daily order storage, and karigar assignments with access control and query/update methods.",
  "feature_evidence.json": "Feature evidence report mapping features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files describing their roles in the daily orders and karigar workflow.",
  "frontend/index.css": "Tailwind setup defining OKLCH-based color variables and base styles for light and dark themes.",
  "frontend/index.html": "Base HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app managing authentication, profile setup, layout, and routing to the daily orders page.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button using Internet Identity with loading states and query cache clearing.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting new users to enter and save their name using a profile mutation.",
  "frontend/src/features/daily-orders/components/AssignmentPanel.tsx": "Dialog UI for assigning selected orders to a karigar and optional factory using a mutation.",
  "frontend/src/features/daily-orders/components/ExportPanel.tsx": "Button component that exports the selected karigar’s orders as an HTML file, handling loading state.",
  "frontend/src/features/daily-orders/components/GroupsSidebar.tsx": "Sidebar listing karigars and their order counts, allowing selection to filter orders by group.",
  "frontend/src/features/daily-orders/components/OrdersTable.tsx": "Table displaying orders with selection checkboxes and assignment status per order.",
  "frontend/src/features/daily-orders/components/OrdersToolbar.tsx": "Toolbar providing text search and design-based sorting controls for the orders list.",
  "frontend/src/features/daily-orders/DailyOrdersPage.tsx": "Main page for uploading, viewing, filtering, assigning, and exporting daily orders, handling state, data loading, and grouping by karigar.",
  "frontend/src/features/daily-orders/excel/parseDailyOrders.ts": "CSV-based parser that extracts order fields from uploaded files and validates required columns.",
  "frontend/src/features/daily-orders/hooks/useOrderFilters.ts": "Hook that filters and sorts orders based on search text and design sort order.",
  "frontend/src/features/daily-orders/pdf/exportKarigarPdf.ts": "Generates an HTML-based report for a karigar’s orders and triggers a file download.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the current identity, auto-refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider for loading, logging in, and clearing user identities using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user profiles, daily orders, and karigar assignments through the actor.",
  "frontend/src/index.css": "Sets up Tailwind base styles and theme variables for light/dark modes using OKLCH color definitions.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/types/jspdf.d.ts": "Empty type definition placeholder for jspdf.",
  "frontend/src/types/xlsx.d.ts": "Empty type definition placeholder for xlsx.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters using query strings, hash routing, and session storage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, animations, and container settings with custom OKLCH-based theme.",
  "project_state.json": "Describes project state, requirements, and features for a manual Excel-based order management workflow."
}