{
  "kind": "build_request",
  "title": "Support master design file upload (Design Code + Generic Name + Karigar Name) and add karigar filtering on Order List",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the master mapping upload/parsing flow so the uploaded file is treated as the fixed “Master Design File” with required columns: Design Code, Generic Name, and Karigar Name. Remove the current flexible/optional rules messaging and align validation + parsing expectations to these three required fields (while still allowing any sheet name).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Remove these rules. Master design file design code, generic name, karigar name will be uploaded and it will be fixed."
        ]
      },
      "acceptanceCriteria": [
        "In the Mapping upload UI, user-facing instructions no longer mention optional columns or priority sheet rules; they specify that the master design file must contain Design Code, Generic Name, and Karigar Name.",
        "Uploading an Excel/PDF mapping file that does not contain all three required columns results in a clear error message indicating which required column(s) are missing.",
        "When a valid master design file is uploaded, the saved mapping blob contains entries that include design, genericName, and karigar for each row (as applicable), and decoding continues to work with useKarigarMappingLookup()."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure orders are matched/enriched using master design file design codes (using the existing canonical design normalization) and expose a Karigar filter control on the Order List page that filters the displayed orders/groups by the selected karigar.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Also match such codes with the orders and filter orders as per karigar on order list page."
        ]
      },
      "acceptanceCriteria": [
        "Order List enrichment continues to match orders to mappings via normalized design code comparison (orders show Generic Name and Karigar Name when mapped).",
        "Order List page provides a user control (e.g., Select) to choose a karigar (including an “All” option).",
        "Selecting a specific karigar shows only that karigar’s orders; selecting “All” shows all karigar groups (current behavior preserved).",
        "The filter options include at least all karigars present in the enriched order data plus an Unmapped option (when applicable)."
      ]
    }
  ],
  "constraints": [
    "Backend remains single-actor (all Motoko logic in backend/main.mo).",
    "Do not edit frontend immutable paths listed in SYSTEM_CONTEXT (compose existing UI components instead).",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding third-party authentication providers (only Internet Identity).",
    "Adding external databases or non-Motoko backend services.",
    "Parsing screenshots/images for mapping upload (no OCR scope)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}