{
  "kind": "build_request",
  "title": "Fix karigar mapping parsing, persist standard mapping, and add 3-tab landing layout with factory-wise swipe view",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-20",
      "text": "Fix karigar mapping Excel parsing so karigar names are assigned correctly by reading the correct columns and prioritizing sheets \"1\" and \"3\" (and treating the \"Name\" column as the generic product name for the product/design code).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "The karigar mapping excel was uploaded. You have mistaken with karigar names, please go through sheet 1 & 3 and filter then the karigar names with order properly. Name column in each of the sheets is our generic name of product against the product code."
        ]
      },
      "acceptanceCriteria": [
        "Uploading the karigar mapping workbook produces a deterministic mapping where each design/product code resolves to the correct karigar name based on sheets 1 and 3.",
        "The parser uses header-based column detection (not positional ‘first two columns’) so that the karigar and design/code columns are not swapped when the sheet layout differs.",
        "The parsed output includes both: (a) design/product code, (b) karigar name, and (c) generic product name from the \"Name\" column (where present).",
        "If sheet \"2\" exists it must not override entries from sheets \"1\" and \"3\" when a design/product code appears in multiple sheets (sheet 1 & 3 take priority).",
        "User-facing parsing errors are shown in English and explain which required columns/sheets are missing."
      ]
    },
    {
      "id": "REQ-21",
      "text": "Persist the karigar mapping workbook as a standard (non-daily) dataset in the backend, with APIs to save a full mapping replacement on upload and to fetch the currently saved mapping for use across all dates.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Third show the karigar mapping, so understand karigar mapping is standard and doesn’t change on a daily basis. It shall only be updated when required and manually will be added with uploading updated excel with sheets."
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes an update method that replaces the stored standard mapping with the newly uploaded mapping entries (design/product code → {karigar name, generic product name}).",
        "Backend exposes a query method to fetch the currently stored standard mapping entries.",
        "The mapping APIs are usable without Internet Identity authentication (consistent with the current anonymous usage of orders/assignments).",
        "If no mapping has been uploaded yet, the fetch API returns an empty result (not a trap)."
      ]
    },
    {
      "id": "REQ-22",
      "text": "Refactor the app entry UI to show a landing header titled \"Shree I Jewellery Order Management System\" and provide a 3-tab navigation: (1) \"Order List\" (factory-wise view), (2) \"Daily Order Upload\", and (3) \"Karigar Mapping\".",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Create a landing page when app is opened show Shree I Jewellery Order Management System.\n\nUnder that have three tabs. First order list that shows the orders filter as per factory wise with given generic names.\n\nSecond show the tab when entered the daily order list is uploaded to.\n\nThird show the karigar mapping"
        ]
      },
      "acceptanceCriteria": [
        "On app open, the top-level page shows the title text exactly: \"Shree I Jewellery Order Management System\".",
        "The UI provides three clearly labeled tabs in English: \"Order List\", \"Daily Order Upload\", and \"Karigar Mapping\".",
        "Each tab shows only its relevant UI (no mixed upload/mapping UI on the Order List tab).",
        "Existing Daily Orders functionality remains accessible via the new tab structure (no loss of capability)."
      ]
    },
    {
      "id": "REQ-23",
      "text": "Update the \"Order List\" tab to display orders factory-wise (one factory visible at a time) with swipe-based navigation between factories, and within each factory group orders karigar-wise with a per-karigar download action displayed above each karigar group.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "In the first tab, order list as per factory wise should be shown and each single factory should be shown on the screen at a single and rest factory will be changed with a good UI slide option.",
          "Above each tab of karigar order filtered give an option to download their orders."
        ]
      },
      "acceptanceCriteria": [
        "In the Order List tab, only one factory’s orders are shown at a time, and the user can change factories via a swipe UI interaction (touch swipe).",
        "Orders within the selected factory are grouped by karigar and rendered as separate sections/cards.",
        "Each karigar section has a clearly visible download button above the karigar’s order table that downloads only that karigar’s orders for the currently selected date.",
        "The per-factory export action remains available (existing behavior), in addition to the per-karigar download.",
        "All user-facing labels/tooltips for these actions are in English."
      ]
    },
    {
      "id": "REQ-24",
      "text": "When displaying orders in the factory/karigar views, sort orders so that items with the same design/product code are grouped together, and display the generic product name (from the mapping workbook \"Name\" column) alongside the design/product code in the UI.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "So while displaying data, sort all same design code items together and filter orders karigar wise.",
          "First order list that shows the orders filter as per factory wise with given generic names."
        ]
      },
      "acceptanceCriteria": [
        "Within each karigar group, orders are sorted primarily by design/product code so same-code items appear together.",
        "If a generic product name exists for a design/product code in the stored standard mapping, the Orders table shows it alongside the design/product code (e.g., \"CODE — Generic Name\" or an equivalent clear presentation).",
        "If no generic name exists for a code, the UI still shows the code without errors or blank/undefined text."
      ]
    },
    {
      "id": "REQ-25",
      "text": "Update the \"Karigar Mapping\" tab to allow uploading an updated mapping workbook at any time (independent of daily order uploads), show an English confirmation/error state, and make the newly uploaded mapping immediately available to the Order List and mapping-apply workflows.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Third show the karigar mapping, so understand karigar mapping is standard and doesn’t change on a daily basis. It shall only be updated when required and manually will be added with uploading updated excel with sheets."
        ]
      },
      "acceptanceCriteria": [
        "The Karigar Mapping tab includes an upload control that accepts .xlsx/.xls mapping workbooks.",
        "Uploading a mapping workbook saves it to the backend standard mapping store and shows a clear English success or error message.",
        "The mapping upload UI does not require that any orders are already uploaded/loaded (no disabled state based on currentOrders length).",
        "After a successful mapping upload, the Order List tab uses the updated mapping for generic names and for matching designs to karigars (after applying assignments as per existing workflow)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor (all logic in backend/main.mo); only add backend/migration.mo if required for preserving existing state on upgrade.",
    "Do not edit any files under frontend/src/components/ui or any paths listed in frontend.immutablePaths.",
    "Use English for all user-facing UI text in the implementation."
  ],
  "nonGoals": [
    "Do not add third-party authentication providers (only Internet Identity exists, and the app should remain usable without login).",
    "Do not implement portal scraping/automation; orders and mapping are still provided by manual uploads.",
    "Do not add external databases or non-Motoko backend services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "User-facing UI text must be English (except the exact app title string requested)."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}