{
  "kind": "build_request",
  "title": "Support karigar mapping files in the same tabular format as the live app example (no required sheet names)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-64",
      "text": "Update the karigar mapping Excel parser so it can successfully parse mapping workbooks that do NOT contain sheets named \"1\", \"2\", or \"3\" (e.g., a single-sheet table like the user’s example with columns \"Design\", \"NAME\", and \"KARIGAR\"), and still preserve the existing priority behavior for workbooks that do contain sheets \"1\"/\"3\"/\"2\".",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "This is an example of karigar mapping for my data in live app. Why are you not able to do this mapping?"
        ]
      },
      "acceptanceCriteria": [
        "Given an uploaded .xlsx/.xls mapping workbook with a single sheet (e.g., \"Sheet1\") that contains headers like \"Design\", \"NAME\", and \"KARIGAR\", parsing succeeds and produces non-zero mapping entries.",
        "Given an uploaded workbook that contains sheets named \"1\", \"2\", and/or \"3\", the parser continues to prioritize sheets in order: 1, then 3, then 2 (current behavior).",
        "If a workbook contains both the traditional sheets and other sheets, the traditional sheet priority remains unchanged.",
        "If no sheets contain a detectable Design + Karigar header pair, the parser fails with a clear English error that lists which sheets were checked and why they were rejected (e.g., missing required columns)."
      ]
    },
    {
      "id": "REQ-65",
      "text": "Improve karigar mapping upload UI copy and error messaging to explicitly support the user’s tabular mapping format (like the screenshot) and to clearly explain why a file cannot be mapped (e.g., unsupported file type such as an image/screenshot, or missing required columns).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "This is an example of karigar mapping for my data in live app. Why are you not able to do this mapping?"
        ]
      },
      "acceptanceCriteria": [
        "Karigar Mapping tab’s “File Format Requirements” text states that the mapping can be any sheet name, as long as the file contains columns for Design Code (Design/Product Code), Karigar, and optional Name/Generic Name.",
        "When a user attempts to upload an unsupported format (e.g., .jpeg screenshot), the UI shows an English error explaining that only Excel (.xlsx/.xls) and PDF are supported and that screenshots/images cannot be parsed.",
        "When parsing fails due to missing required columns, the UI shows an English error that states which required columns were not found (Design and Karigar) and suggests using headers like “Design” and “Karigar”."
      ]
    },
    {
      "id": "REQ-66",
      "text": "After a successful karigar mapping upload, show a small English summary in the Karigar Mapping tab indicating the number of mapping entries parsed and the sheet(s) used, to help users confirm that the uploaded mapping resembles the live-app example.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "This is an example of karigar mapping for my data in live app. Why are you not able to do this mapping?"
        ]
      },
      "acceptanceCriteria": [
        "After a successful upload/save, the Karigar Mapping tab displays a summary including: total mapping entries parsed and the sheet name(s) used.",
        "The summary is shown only when a mapping is currently loaded (either immediately after upload or after fetching existing mapping).",
        "All summary text is in English and does not expose raw stack traces or internal exceptions."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (compose existing shadcn components instead).",
    "Do not modify frontend immutable paths (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Backend must remain a single-actor Motoko canister (no additional backend services)."
  ],
  "nonGoals": [
    "Add support for uploading/reading mapping data from images/screenshots (e.g., .jpeg/.png OCR).",
    "Change design-code normalization rules (unless required to fix the new sheet-selection support).",
    "Change backend authorization rules or roles as part of this request."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}