{
  "kind": "build_request",
  "title": "Support two-Excel upload: cumulative orders as today + multi-sheet design→karigar mapping for auto-grouping",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-8",
      "text": "Update the Daily Orders page to support uploading two separate files for the selected date (default: today): (1) an OrderList workbook that contains cumulative orders and must be displayed/stored as the selected date’s orders, and (2) a karigar mapping workbook (\"mbar0502 copy\") used to auto-group/filter orders karigar-wise.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-USER-1"
        ],
        "quotes": [
          "Now I’m sharing you two excel files\n\n1) OrderList17 , that contains total order till date so show this all orders as orders of today’s date \n2) mbar0502 copy, this excel has three sheet named 1,2,3 all these sheets contain karigar name as per design wise \n\nUploading these are opening data and filtering all the orders as per karigar wise."
        ]
      },
      "acceptanceCriteria": [
        "The page provides two clearly labeled upload inputs/areas: one for the OrderList file and one for the karigar mapping file.",
        "Uploading the OrderList file replaces the current in-memory orders and stores them under the currently selected date (default today), regardless of whether the file contains historical/cumulative rows.",
        "Uploading the mapping file does not overwrite the stored orders; it only affects karigar grouping/assignments for the selected date.",
        "All user-facing UI text for the new controls is in English."
      ]
    },
    {
      "id": "REQ-9",
      "text": "Add support for parsing the provided OrderList Excel workbook format (e.g., OrderList17) from .xlsx/.xls (and still accept .csv) and extract the same required order fields per row: Order No, Design, Weight, Size, Quantity, Remarks.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-USER-1"
        ],
        "quotes": [
          "1) OrderList17 , that contains total order till date so show this all orders as orders of today’s date"
        ]
      },
      "acceptanceCriteria": [
        "The OrderList upload accepts .xlsx/.xls and .csv files.",
        "After upload, the app displays a table of parsed orders using the extracted fields (Order No, Design, Weight, Size, Quantity, Remarks).",
        "If required columns are missing, the app shows a clear error describing which columns are missing.",
        "The upload no longer blocks users with a 'Please export to CSV' error when they provide a valid .xlsx/.xls file."
      ]
    },
    {
      "id": "REQ-10",
      "text": "Implement parsing of the karigar mapping workbook (e.g., \"mbar0502 copy\") that contains three sheets named \"1\", \"2\", and \"3\"; combine these sheets into a single Design → Karigar mapping and use it to automatically assign/group orders karigar-wise for the selected date based on each order’s Design value.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-USER-1"
        ],
        "quotes": [
          "2) mbar0502 copy, this excel has three sheet named 1,2,3 all these sheets contain karigar name as per design wise",
          "Uploading these are opening data and filtering all the orders as per karigar wise."
        ]
      },
      "acceptanceCriteria": [
        "The mapping upload accepts .xlsx/.xls (and optionally .csv if feasible) and reads sheets named \"1\", \"2\", and \"3\" when present.",
        "The app derives karigar assignments for orders by matching the order’s Design to the mapping workbook’s design-wise karigar entries.",
        "After applying the mapping, the Groups (karigar) sidebar populates automatically and selecting a karigar filters the displayed orders accordingly.",
        "Auto-assignments are persisted for the selected date using existing backend assignment storage, so reloading the date shows the same karigar grouping without re-uploading the mapping file."
      ]
    },
    {
      "id": "REQ-11",
      "text": "Add a safe 'Apply mapping' workflow and visibility into mapping results, including how many orders were assigned per karigar and which order designs could not be matched; ensure manual assignment remains available and can override auto-assigned results when needed.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-USER-1"
        ],
        "quotes": [
          "Uploading these are opening data and filtering all the orders as per karigar wise."
        ]
      },
      "acceptanceCriteria": [
        "After uploading the mapping workbook, the UI shows a summary: total orders matched/assigned, and a list/count of unmatched designs (or unmatched orders).",
        "The UI provides an explicit action to apply the mapping to the selected date (or clearly indicates that upload immediately applies it), and prevents accidental silent overwrites.",
        "Manual assignment UI (existing Assignment panel) still works after mapping is applied and can change assignments for selected orders.",
        "If an order already has an assignment for the selected date, the UI provides a clear option controlling whether mapping should overwrite existing assignments or only fill missing assignments."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor with all logic in backend/main.mo; add backend/migration.mo only if a persisted-state schema change is required.",
    "Do not edit any files under frontend/src/components/ui or any frontend immutable paths listed in SYSTEM_CONTEXT; compose existing UI components instead.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Automating portal login/exports or scraping orders from a third-party portal.",
    "Adding third-party authentication providers (only Internet Identity is supported).",
    "Adding external databases or non-Internet-Computer backend services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}