{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Daily Order Upload: robust Weight/Size/Quantity/Remarks extraction + user-visible parse diagnostics",
  "requirements": [
    {
      "id": "REQ-49",
      "summary": "Harden Daily Order Upload parser to reliably detect the true header row and map common header variants/whitespace to Order No/Design/Weight/Size/Quantity/Remarks for XLSX/XLS/CSV.",
      "acceptanceCriteria": [
        "Uploading a representative OrderList .xlsx/.xls that contains Weight/Size/Quantity/Remarks results in those columns being populated in the parsed output (not blank) when the source file has values.",
        "If the file has extra title rows before the actual header row, the parser still detects the correct header row and maps the correct columns to Order No/Design/Weight/Size/Quantity/Remarks.",
        "If the header labels use common variations (e.g., \"Remark's\", \"Qty.\", \"Net Wt\"), the parser still matches them to the correct required fields.",
        "Parser behavior remains compatible with .csv uploads and does not regress Order No/Design extraction."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/daily-orders/excel/parseDailyOrders.ts",
          "operation": "modify",
          "description": "Improve header-row detection and column matching robustness: normalize header cells using existing text normalization utilities (including removal of hidden/unusual whitespace); expand header aliases for Weight/Size/Quantity/Remarks (covering punctuation/casing variants such as \"Remark's\", \"Qty.\", \"Net Wt\"); strengthen scoring/selection of non-first header rows; and apply normalization consistently for CSV cell parsing so required fields extract non-empty values when present."
        },
        {
          "path": "frontend/src/utils/textNormalize.ts",
          "operation": "modify",
          "description": "Extend normalization utilities as needed to better handle hidden/unusual whitespace and punctuation patterns seen in real OrderList headers/cells, ensuring header matching and extracted values remain stable across XLSX/XLS/CSV."
        }
      ]
    },
    {
      "id": "REQ-50",
      "summary": "Show Daily Order Upload parsing warnings and detected-header details in the UI (English) so users can understand missing optional columns and when a non-first header row was used.",
      "acceptanceCriteria": [
        "When optional columns (Weight/Size/Quantity/Remarks) are not detected, the Daily Order Upload page shows a visible, non-crashing warning message listing the missing columns.",
        "When parsing succeeds but uses a header row that is not the first row, the UI indicates which row was treated as the header (e.g., \"Detected headers on row N\").",
        "Warnings do not block saving parsed orders to the backend when parsing otherwise succeeds."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/daily-orders/excel/parseDailyOrders.ts",
          "operation": "modify",
          "description": "Change parser to return structured parse diagnostics (e.g., warnings plus detected header row index and detected headers) alongside parsed orders, rather than only console logging warnings."
        },
        {
          "path": "frontend/src/features/daily-orders/DailyOrdersPage.tsx",
          "operation": "modify",
          "description": "Render user-visible parsing diagnostics using existing shadcn/ui Alert/Card components: display a non-blocking warning for missing optional columns (Weight/Size/Quantity/Remarks) and display detected header-row info when the header is not on the first row; ensure these warnings do not prevent the save attempt when parsing succeeds. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-51",
      "summary": "Keep the Daily Order Upload flow resilient after parser changes: parsed rows always populate the on-page table, save attempts proceed, and parse/save failures show clear English errors without losing parsed data on save failure.",
      "acceptanceCriteria": [
        "After uploading a valid file, the Daily Order Upload page shows the parsed row count and a table including Order No, Design, Weight, Size, Quantity, Remarks.",
        "If parsing succeeds but storing to the backend fails, the parsed orders remain visible in the UI and an English 'saving failed' error is shown (separate from parsing errors).",
        "If parsing fails, the UI shows an English parsing error and does not crash; the file input is reset so the user can retry."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/daily-orders/DailyOrdersPage.tsx",
          "operation": "modify",
          "description": "Update the upload handler to work with the new parse result shape while preserving current resilience: keep parsed orders visible even if saving fails (and keep save error separate from parse error), show clear English parse errors on parse failures, and ensure the file input is reset to allow retry without crashing. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/utils/userFacingError.ts",
          "operation": "modify",
          "description": "Ensure user-facing error messages remain clear and appropriately separated for parsing vs saving failures after parser changes (keep parsing-specific messages detailed and in English)."
        }
      ]
    }
  ]
}