{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix PDF.js loading and worker configuration for Karigar Mapping PDF uploads",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure PDF.js browser library is loaded and available as window.pdfjsLib before Karigar Mapping parses PDF uploads.",
      "acceptanceCriteria": [
        "Uploading a .pdf in the Karigar Mapping tab no longer fails with the error text \"PDF.js library not loaded\".",
        "The PDF.js library is available at runtime as window.pdfjsLib before parseKarigarMapping(file) attempts to parse a PDF."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Load the PDF.js browser bundle as a static script (in addition to the existing SheetJS script) so window.pdfjsLib is present at runtime for PDF parsing."
        },
        {
          "path": "frontend/public/vendor/pdfjs/pdf.min.js",
          "operation": "create",
          "description": "Add the PDF.js browser distribution file that exposes pdfjsLib on the window object for use by the existing PDF parsing logic."
        },
        {
          "path": "frontend/src/utils/pdfjs.ts",
          "operation": "create",
          "description": "Create a small runtime helper that verifies window.pdfjsLib is available (and can optionally attempt to load/validate it) before PDF parsing starts."
        },
        {
          "path": "frontend/src/features/daily-orders/excel/parseKarigarMapping.ts",
          "operation": "modify",
          "description": "Integrate the PDF.js availability check so PDF parsing attempts only proceed when window.pdfjsLib is present; otherwise throw a consistent missing-library error used by the UI."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Configure PDF.js worker source at runtime so PDF parsing works reliably in production builds on the Internet Computer.",
      "acceptanceCriteria": [
        "PDF parsing works in production (not just local dev) for at least one multi-page PDF mapping file.",
        "No console error about missing/failed PDF worker occurs during PDF parsing (or a documented fallback disables the worker cleanly without breaking parsing)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/vendor/pdfjs/pdf.worker.min.js",
          "operation": "create",
          "description": "Add the PDF.js worker file as a static asset so the app can point pdfjsLib.GlobalWorkerOptions.workerSrc to a same-origin URL in production."
        },
        {
          "path": "frontend/src/utils/pdfjs.ts",
          "operation": "modify",
          "description": "Configure pdfjsLib.GlobalWorkerOptions.workerSrc to the bundled worker asset URL and provide a safe fallback (e.g., disableWorker) if worker setup fails, without breaking PDF parsing."
        },
        {
          "path": "frontend/src/features/daily-orders/excel/parseKarigarMapping.ts",
          "operation": "modify",
          "description": "Ensure PDF document loading uses the worker-configured pdfjsLib setup (and uses the documented fallback path if worker configuration is unavailable)."
        },
        {
          "path": "frontend/ic-assets.json5",
          "operation": "modify",
          "description": "Verify static asset caching rules cover the added PDF.js vendor files so they are served correctly in production on the Internet Computer."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Show an actionable, English Karigar Mapping upload error when PDF.js is missing/unavailable, guiding users to retry or use Excel.",
      "acceptanceCriteria": [
        "When PDF parsing cannot start due to missing/unavailable PDF.js, the UI displays an English error message that tells the user what to do next (e.g., refresh/retry, or upload .xlsx/.xls instead).",
        "The error is shown in the existing Karigar Mapping tab error area and preserves whitespace formatting (whitespace-pre-wrap)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/userFacingError.ts",
          "operation": "modify",
          "description": "Add explicit handling for the \"PDF.js library not loaded\" (and related worker/initialization failures) to return an actionable, multi-line English message advising refresh/retry and Excel (.xlsx/.xls) fallback."
        },
        {
          "path": "frontend/src/features/karigar-mapping/KarigarMappingTab.tsx",
          "operation": "modify",
          "description": "Ensure PDF.js missing/unavailable errors are surfaced through the existing Karigar Mapping error area (already whitespace-pre-wrap) without being overwritten by generic messaging."
        }
      ]
    }
  ]
}