{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fixed Master Design File upload + Karigar filtering on Order List",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make the mapping upload a fixed Master Design File with required columns (Design Code, Generic Name, Karigar Name) and update UI messaging + validation accordingly.",
      "acceptanceCriteria": [
        "In the Mapping upload UI, user-facing instructions no longer mention optional columns or priority sheet rules; they specify that the master design file must contain Design Code, Generic Name, and Karigar Name.",
        "Uploading an Excel/PDF mapping file that does not contain all three required columns results in a clear error message indicating which required column(s) are missing.",
        "When a valid master design file is uploaded, the saved mapping blob contains entries that include design, genericName, and karigar for each row (as applicable), and decoding continues to work with useKarigarMappingLookup()."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/daily-orders/excel/parseKarigarMapping.ts",
          "operation": "modify",
          "description": "Update parsing/validation to treat the upload as a fixed Master Design File: require header presence for Design Code + Generic Name + Karigar Name (while still allowing any sheet name), and emit clear missing-column errors naming the exact missing required column(s) for both Excel and PDF parsing."
        },
        {
          "path": "frontend/src/features/karigar-mapping/KarigarMappingTab.tsx",
          "operation": "modify",
          "description": "Update Mapping upload UI copy to remove optional-column and priority-sheet messaging; rename/position the upload as a Master Design File with the three required columns (English text), and ensure error rendering remains clear for missing required columns."
        },
        {
          "path": "frontend/src/features/karigar-mapping/karigarMappingBlobCodec.ts",
          "operation": "modify",
          "description": "Adjust encoding/decoding expectations to align with the fixed Master Design File fields (design, karigar, genericName) while maintaining backward-compatible decoding for existing blobs and preserving useKarigarMappingLookup() behavior."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add a Karigar filter control on Order List and filter displayed groups/orders by selected karigar, including All and Unmapped options, while keeping design-code normalization enrichment.",
      "acceptanceCriteria": [
        "Order List enrichment continues to match orders to mappings via normalized design code comparison (orders show Generic Name and Karigar Name when mapped).",
        "Order List page provides a user control (e.g., Select) to choose a karigar (including an “All” option).",
        "Selecting a specific karigar shows only that karigar’s orders; selecting “All” shows all karigar groups (current behavior preserved).",
        "The filter options include at least all karigars present in the enriched order data plus an Unmapped option (when applicable)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/order-list/OrderListTab.tsx",
          "operation": "modify",
          "description": "Add a Karigar filter UI control (English text) that is populated from enriched order data (unique karigars + All, and Unmapped when applicable), wire it to selectedKarigar state, and filter the rendered group(s) accordingly while preserving existing normalized design-code enrichment."
        },
        {
          "path": "frontend/src/features/order-list/components/KarigarOrderGroups.tsx",
          "operation": "modify",
          "description": "Ensure group rendering behavior correctly supports the new filter options, especially the Unmapped group (only shown/selectable when there are unmapped orders) and preserves existing All behavior."
        }
      ]
    }
  ]
}