{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Two-file upload and Excel parsing for daily orders + karigar mapping auto-grouping",
  "requirements": [
    {
      "id": "REQ-8",
      "summary": "Update Daily Orders page to support two separate uploads per selected date: OrderList (cumulative orders stored/displayed as that date) and karigar mapping workbook (used only for grouping/assignments).",
      "acceptanceCriteria": [
        "The page provides two clearly labeled upload inputs/areas: one for the OrderList file and one for the karigar mapping file.",
        "Uploading the OrderList file replaces the current in-memory orders and stores them under the currently selected date (default today), regardless of whether the file contains historical/cumulative rows.",
        "Uploading the mapping file does not overwrite the stored orders; it only affects karigar grouping/assignments for the selected date.",
        "All user-facing UI text for the new controls is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/daily-orders/DailyOrdersPage.tsx",
          "operation": "modify",
          "description": "Replace the single upload control with two clearly labeled upload controls: (1) \"Upload OrderList\" (accept .csv/.xlsx/.xls) that parses and stores orders for the selected date, and (2) \"Upload Karigar Mapping\" (accept .xlsx/.xls, optionally .csv) that loads mapping into local page state for later application. Ensure OrderList upload replaces in-memory orders and persists them under the currently selected date without being affected by mapping upload. Remove/replace any CSV-only helper text so all new user-facing text is English."
        },
        {
          "path": "frontend/src/features/daily-orders/components/GroupsSidebar.tsx",
          "operation": "modify",
          "description": "Adjust sidebar labeling/count behavior if needed to reflect karigar groups created from persisted assignments after mapping is applied (and keep 'All Orders' behavior consistent when there are orders but no groups yet)."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Support parsing OrderList uploads from .xlsx/.xls as well as .csv, extracting Order No, Design, Weight, Size, Quantity, Remarks with clear missing-column errors.",
      "acceptanceCriteria": [
        "The OrderList upload accepts .xlsx/.xls and .csv files.",
        "After upload, the app displays a table of parsed orders using the extracted fields (Order No, Design, Weight, Size, Quantity, Remarks).",
        "If required columns are missing, the app shows a clear error describing which columns are missing.",
        "The upload no longer blocks users with a 'Please export to CSV' error when they provide a valid .xlsx/.xls file."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/daily-orders/excel/parseDailyOrders.ts",
          "operation": "modify",
          "description": "Extend the existing parser to handle .xlsx/.xls using the existing/available XLSX parsing capability (SheetJS-style) while keeping .csv support. Implement robust header detection and emit a clear error listing missing required columns (Order No, Design, Weight, Size, Quantity, Remarks). Remove the current hard-blocking error message that instructs users to export to CSV for valid .xlsx/.xls files."
        },
        {
          "path": "frontend/src/types/xlsx.d.ts",
          "operation": "modify",
          "description": "Add minimal TypeScript type declarations (or module declaration) required for the XLSX parsing import used by the OrderList and mapping parsers, so the project compiles cleanly."
        },
        {
          "path": "frontend/src/features/daily-orders/DailyOrdersPage.tsx",
          "operation": "modify",
          "description": "Update the OrderList upload input accept list to include .csv,.xlsx,.xls, and ensure parsing errors from the enhanced parser are displayed in the existing error alert."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Parse karigar mapping workbook with sheets \"1\", \"2\", \"3\" into a combined Design → Karigar mapping and use it to auto-assign/group orders for the selected date based on Design.",
      "acceptanceCriteria": [
        "The mapping upload accepts .xlsx/.xls (and optionally .csv if feasible) and reads sheets named \"1\", \"2\", and \"3\" when present.",
        "The app derives karigar assignments for orders by matching the order’s Design to the mapping workbook’s design-wise karigar entries.",
        "After applying the mapping, the Groups (karigar) sidebar populates automatically and selecting a karigar filters the displayed orders accordingly.",
        "Auto-assignments are persisted for the selected date using existing backend assignment storage, so reloading the date shows the same karigar grouping without re-uploading the mapping file."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/daily-orders/excel/parseKarigarMapping.ts",
          "operation": "create",
          "description": "Create a dedicated mapping parser that reads an uploaded mapping workbook (.xlsx/.xls) and combines sheets named \"1\", \"2\", and \"3\" into a normalized Design → Karigar map (including basic cleaning/trim rules)."
        },
        {
          "path": "frontend/src/features/daily-orders/DailyOrdersPage.tsx",
          "operation": "modify",
          "description": "Wire the new mapping upload to parseKarigarMapping.ts, store the resulting mapping in local state, and on user apply action derive orderId groups by matching each order's Design. Persist assignments for the selected date by invoking the existing assignment mutation for each karigar group so groups appear in the sidebar and persist across reloads."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add or adjust query invalidation patterns as needed so that after applying mapping-based assignments, the karigar assignments query for the selected date refreshes and the Groups sidebar updates accordingly."
        }
      ]
    },
    {
      "id": "REQ-11",
      "summary": "Add an explicit 'Apply mapping' workflow with summary (matched per karigar + unmatched designs/orders) and overwrite control; ensure manual assignment continues to work and can override auto-assignments.",
      "acceptanceCriteria": [
        "After uploading the mapping workbook, the UI shows a summary: total orders matched/assigned, and a list/count of unmatched designs (or unmatched orders).",
        "The UI provides an explicit action to apply the mapping to the selected date (or clearly indicates that upload immediately applies it), and prevents accidental silent overwrites.",
        "Manual assignment UI (existing Assignment panel) still works after mapping is applied and can change assignments for selected orders.",
        "If an order already has an assignment for the selected date, the UI provides a clear option controlling whether mapping should overwrite existing assignments or only fill missing assignments."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/daily-orders/components/MappingApplyPanel.tsx",
          "operation": "create",
          "description": "Add a UI panel component that displays mapping upload status, a computed summary (matched counts per karigar, total matched, total unmatched), an overwrite option (overwrite existing vs fill only), and an explicit \"Apply mapping\" action that triggers the apply flow. Use existing shadcn-ui components already present in the codebase (do not edit files under frontend/src/components/ui). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/daily-orders/DailyOrdersPage.tsx",
          "operation": "modify",
          "description": "Integrate MappingApplyPanel into the Daily Orders sidebar below the mapping upload. Compute and pass summary data (including unmatched designs/orders) based on current orders, current assignments, and the parsed mapping; implement the apply behavior to respect the overwrite control. Ensure the existing AssignmentPanel remains unchanged and continues to allow manual overrides after mapping is applied."
        }
      ]
    }
  ]
}