{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Build/fix a karigar mapping feature that reads an Excel sheet containing Design, NAME, and KARIGAR columns and correctly matches/normalizes design codes so mappings apply reliably.",
  "architectural_notes": [
    "Treat the Excel as the mapping table: each row contains Design, NAME (Generic Name), and KARIGAR (Karigar Name).",
    "Parser should accept any sheet name as long as it has columns named (case-insensitive): Design, NAME, KARIGAR.",
    "Apply one shared normalization rule to design codes on both the mapping input and the OrderList input before matching."
  ],
  "known_issues": [
    "Karigar mapping currently fails due to inconsistent/insufficient normalization of design codes causing 0/low matches even when codes look identical."
  ],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-update-karigar-mapping-excel-parsing-to-support-the-user-s-excel-style-mapping-table-on-any-sheet-name-design-name-karigar-even-when-the-workbook-also-contains-sheets-named-1-2-or-3-priority-sheets-1-3-2-should-still-be-parsed-first-but-the-parser-must-also-scan-remaining-sheets-and-include-any-sheet-that-contains-the-required-columns",
      "title": "Update karigar mapping Excel parsing to support the user’s Excel-style mapping table on any sheet name (Design + NAME + KARIGAR), even when the workbook also contains sheets named \"1\", \"2\", or \"3\". Priority sheets (1 → 3 → 2) should still be parsed first, but the parser must also scan remaining sheets and include any sheet that contains the required columns.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-fix-mapping-lookup-application-so-that-order-list-enrichment-uses-mappings-from-any-parsed-sheet-name-not-only-sheets-1-3-and-2-preserve-the-existing-priority-behavior-for-sheets-1-3-2-but-fall-back-to-all-other-sheets-when-present-ensuring-orders-enrich-correctly-when-the-mapping-workbook-uses-arbitrary-sheet-names",
      "title": "Fix mapping lookup application so that Order List enrichment uses mappings from any parsed sheet name, not only sheets \"1\", \"3\", and \"2\". Preserve the existing priority behavior for sheets \"1\", \"3\", \"2\" but fall back to all other sheets when present, ensuring orders enrich correctly when the mapping workbook uses arbitrary sheet names.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    },
    {
      "id": "feature-ensure-design-code-matching-uses-a-single-shared-canonical-normalization-for-both-mapping-ingestion-and-order-enrichment-using-the-existing-normalizedesigncode-behavior-and-add-keep-clear-diagnostics-to-help-detect-remaining-mismatches-e-g-show-sample-normalized-keys-from-orders-and-mapping-when-there-are-0-matches",
      "title": "Ensure design-code matching uses a single shared canonical normalization for both mapping ingestion and order enrichment (using the existing normalizeDesignCode behavior) and add/keep clear diagnostics to help detect remaining mismatches (e.g., show sample normalized keys from orders and mapping when there are 0 matches).",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Fix karigar mapping: parse Excel mapping table (Design, NAME, KARIGAR) from any sheet name and apply a single shared design-code normalization so matching works correctly",
      "reqIds": [],
      "status": "in_progress"
    }
  ],
  "projectName": "Fix karigar mapping matching by scanning all sheets and applying consistent design-code normalization",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}