{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-05T20:08:05.022Z",
  "summary": "Diff implements two separate uploads on Daily Orders (orders + mapping), adds Excel (.xlsx/.xls) parsing for OrderList with required-column validation, adds multi-sheet (\"1\",\"2\",\"3\") mapping parsing, and introduces an Apply Mapping UI with overwrite toggle and matched/unmatched summary. Backend schema was changed (migration added) to include an order.design field and a new designToKarigar map, but persistence details for auto-assignments are not fully verifiable from the truncated diff.",
  "missing_requirements": [
    {
      "id": "REQ-10",
      "requirement": "Auto-assignments are persisted for the selected date using existing backend assignment storage, so reloading the date shows the same karigar grouping without re-uploading the mapping file.",
      "reason": "Frontend shows mapping parsing and an apply workflow UI, but the diff summary is truncated before showing that applying the mapping actually calls the existing backend assignment storage (e.g., useAssignKarigar/assignKarigar) for all matched orders and persists them for the selected date. This may be implemented, but it is not provable from the provided truncated evidence.",
      "evidence": [
        "frontend/src/features/daily-orders/DailyOrdersPage.tsx (truncated)",
        "frontend/src/features/daily-orders/components/MappingApplyPanel.tsx (truncated)"
      ]
    }
  ],
  "hallucinated_features": [
    {
      "description": "Backend introduces a persisted global designToKarigar mapping state and migration for it.",
      "reason": "REQ-10/REQ-11 require using the mapping workbook to assign/group orders per selected date and persist assignments using existing assignment storage; they do not request persisting the mapping itself globally in backend state. The diff adds `designToKarigar` to the actor state and migration without clear linkage to a requested requirement.",
      "evidence": [
        "backend/main.mo",
        "backend/migration.mo"
      ]
    }
  ],
  "confidence": 0.63,
  "changed_files": [
    "backend/main.mo",
    "backend/migration.mo",
    "frontend-file-summaries.txt",
    "frontend/index.html",
    "frontend/src/features/daily-orders/DailyOrdersPage.tsx",
    "frontend/src/features/daily-orders/components/MappingApplyPanel.tsx",
    "frontend/src/features/daily-orders/excel/parseDailyOrders.ts",
    "frontend/src/features/daily-orders/excel/parseKarigarMapping.ts",
    "frontend/src/types/xlsx.d.ts",
    "project_state.json"
  ]
}